/* */
/* Copyright (c) 2008 Software Ambience Corp. All rights reserved. */
/* */


"Report_SmallerObjects" = "…smaller objects…"; /* sidebar item, representing the a group of consolidated small objects */
"Report_HiddenSpace" = "(hidden space)"; /* hidden space (cannot be revealed without extra permissions) */

"Report_Button_DisksAndFolders" = "Disks and Folders";

"Report_EmptyVolume" = "This volume is empty";
"Report_EmptyFolder" = "This folder is empty";
"Report_RestrictedVolume" = "Restricted volume";
"Report_RestrictedFolder" = "Restricted folder";

"Report_RestrictedVolumeAdmin" = "Restricted volume\nScan as Administrator to reveal it.";
"Report_RestrictedFolderAdmin" = "Restricted folder\nScan as Administrator to reveal it.";

/* hidden space description as appears on the sidebar when pointing to it */
"Report_Hidden_SystemAdminManyUsers" = "This space is taken by ﬁles that require extra permissions to be accessed, and very likely belong to other user accounts. Rescan the disk as Administrator to reveal them.";
"Report_Hidden_SystemAdminOneUser" = "This space is taken by restricted and system ﬁles that require extra permissions to be accessed. Rescan the disk as Administrator to reveal them.";
"Report_Hidden_NonSystemAdmin" = "This space is taken by ﬁles that require extra permissions to be accessed. Scan the disk as Administrator to reveal them.";
"Report_Hidden_UnknownSpace" = "Unfortunately, DaisyDisk is unable to locate these data. They are not accessible to users.";

/* context menu for sidebar items */
"Report_Menu_Collect" = "Move “%@” to Collector";
"Report_Menu_CollectDisabled" = "Move to Collector";
"Report_Menu_Uncollect" = "Remove “%@” from Collector";
"Report_Menu_UncollectDisabled" = "Remove from Collector";

/* text displayed on the Collector */
"Report_Collector_Message_Empty" = "Drag and drop files here to collect them";
"Report_Collector_Message_FullCollected" = "%@ collected";
"Report_Collector_Message_FullNoItems" = "No items collected";
"Report_Collector_Message_FullZeroSizedItems" = "Microscopic items collected";
"Report_Collector_Button_Delete" = "Delete"; /* Delete button */

/* read-only disk or folder: the message replaces Collector */
"Report_Collector_Message_ReadOnlyVolume" = "Disk “%@” is read only";
"Report_Collector_Message_ReadOnlyFolder" = "Folder “%@” is read only";

/* dragging different items to the Collector */
"Report_Collector_Message_System" = "“%@” is required by OS X and should not be removed";
"Report_Collector_Message_ReadOnlyItem" = "“%@” is read-only and cannot not be removed";
"Report_Collector_Message_SmallerItems" = "Expand “smaller objects” to remove individual files";
"Report_Collector_Message_TimeMachine" = "Use Time Machine interface to delete data from the backups";
"Report_Collector_Message_HiddenSpace" = "Scan as Administrator to reveal the hidden space";
"Report_Collector_Message_UnknownHiddenSpace" = "Cannot delete the hidden space, unable to locate the files";

"Report_Collector_Message_CountDownPart1" = "seconds to start. The files will be"; /* deletion start countdown */
"Report_Collector_Message_CountDownPart2" = "deleted forever!"; /* warning message near the countdown */
"Report_Collector_Button_Stop" = "Stop"; /* stop button */
"Report_Collector_Message_DeletionProgress" = "Deletion in progress… %d%%"; /* deletion progress display */

/* some files cannot be deleted message on the Collector */
"Report_Collector_Message_Error" = "Some files were not deleted";
"Report_Collector_Button_View" = "View";

/* item removal hint text on the top of Collector */
"Report_Collector_DrawerHeader" = "Drag items out to remove them from the list";

/* scopebar messages: non-modal error reports and reminders */
"Report_ScopebarError_NoVolume" = "The source disk was removed. Mount it back to proceed"; /* disk ejected while browsing the map */
"Report_ScopebarError_NoFolder" = "The folder is missing. Rescan recommended"; /* folder removed/renamed since the last scan */
"Report_ScopebarError_NoFile" = "The file is missing. Rescan recommended";
"Report_ScopebarError_NoCurrentFolder" = "The current folder is missing. Rescan recommended";
"Report_ScopebarError_NoTopmostFolder" = "The scanned folder is missing";
"Report_ScopebarError_Button_Rescan" = "Rescan"; /* scope bar action button */
"Report_ScopebarError_NoAdminHelper" = "Administrator mode failure. Restarting DaisyDisk is recommended";
"Report_ScopebarError_Button_Restart" = "Restart"; /* scope bar action button */
"Report_ScopebarError_DeletionTimedOut" = "Deletion timed out. File system not responding";
"Report_ScopebarError_ConnectionLost" = "Connection lost. Restore connection to server and retry";
"Report_ScopebarError_AuthError" = "Authorization error. The server requires reauthorization";
"Report_ScopebarError_Button_Reauthorize" = "Reauthorize";

